report.example/oltp_read_only_1threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 769.01 qps: 12317.21 (r/w/o: 10778.18/0.00/1539.03) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 789.12 qps: 12625.86 (r/w/o: 11047.63/0.00/1578.23) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 761.00 qps: 12175.03 (r/w/o: 10653.02/0.00/1522.00) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 791.00 qps: 12643.98 (r/w/o: 11062.99/0.00/1581.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 792.00 qps: 12677.02 (r/w/o: 11092.02/0.00/1585.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 789.00 qps: 12632.99 (r/w/o: 11054.99/0.00/1578.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 793.00 qps: 12682.01 (r/w/o: 11096.01/0.00/1586.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 790.99 qps: 12659.77 (r/w/o: 11077.80/0.00/1581.97) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 792.01 qps: 12665.20 (r/w/o: 11081.17/0.00/1584.02) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 794.00 qps: 12701.06 (r/w/o: 11113.05/0.00/1588.01) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 1 tps: 787.99 qps: 12611.89 (r/w/o: 11035.91/0.00/1575.99) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1 tps: 793.90 qps: 12711.40 (r/w/o: 11123.60/0.00/1587.80) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 1 tps: 794.10 qps: 12704.64 (r/w/o: 11116.44/0.00/1588.21) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 1 tps: 762.00 qps: 12189.05 (r/w/o: 10665.05/0.00/1524.01) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 792.00 qps: 12675.00 (r/w/o: 11091.00/0.00/1584.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 1 tps: 792.00 qps: 12670.96 (r/w/o: 11086.96/0.00/1583.99) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 1 tps: 793.00 qps: 12688.01 (r/w/o: 11102.01/0.00/1586.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1 tps: 791.99 qps: 12669.91 (r/w/o: 11085.92/0.00/1583.99) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 1 tps: 792.00 qps: 12664.99 (r/w/o: 11080.99/0.00/1584.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 793.01 qps: 12692.10 (r/w/o: 11106.09/0.00/1586.01) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1 tps: 779.00 qps: 12468.98 (r/w/o: 10910.98/0.00/1558.00) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 1 tps: 779.00 qps: 12452.98 (r/w/o: 10894.98/0.00/1558.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 1 tps: 782.00 qps: 12515.05 (r/w/o: 10951.04/0.00/1564.01) lat (ms,95%): 1.32 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1 tps: 757.00 qps: 12120.01 (r/w/o: 10606.01/0.00/1514.00) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 774.00 qps: 12378.99 (r/w/o: 10830.99/0.00/1548.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 1 tps: 775.00 qps: 12406.00 (r/w/o: 10856.00/0.00/1550.00) lat (ms,95%): 1.58 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1 tps: 776.00 qps: 12415.00 (r/w/o: 10863.00/0.00/1552.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 1 tps: 781.00 qps: 12496.00 (r/w/o: 10934.00/0.00/1562.00) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 1 tps: 782.99 qps: 12528.85 (r/w/o: 10962.87/0.00/1565.98) lat (ms,95%): 1.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            329266
        write:                           0
        other:                           47038
        total:                           376304
    transactions:                        23519  (783.90 per sec.)
    queries:                             376304 (12542.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0014s
    total number of events:              23519

Latency (ms):
         min:                                    1.20
         avg:                                    1.28
         max:                                    3.45
         95th percentile:                        1.32
         sum:                                29989.22

Threads fairness:
    events (avg/stddev):           23519.0000/0.00
    execution time (avg/stddev):   29.9892/0.00